exacttarget/exacttarget-connector/exacttarget-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/requests/exacttarget/api_updateTriggeredSendDefinition_negative.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://exacttarget.com/wsdl/partnerAPI"
   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soapenv:Header>
      <fueloauth xmlns="http://exacttarget.com">%s(accessToken)</fueloauth>
   </soapenv:Header>
   <soapenv:Body>
      <UpdateRequest xmlns="http://exacttarget.com/wsdl/partnerAPI">
         <Objects xsi:type="TriggeredSendDefinition">
            <ObjectID xsi:nil="true" />
            <CustomerKey>--INVALID--</CustomerKey>
            <TriggeredSendStatus>Inactive</TriggeredSendStatus>
         </Objects>
      </UpdateRequest>
   </soapenv:Body>
</soapenv:Envelope>